app/controllers/members/omniauth_callbacks_controller.rb

  def google_oauth2
    member = Member.from_google(email: auth.info.email, full_name: auth.info.name, admin: false)

    # Update token if expired, create token if it doesn't exist
    if !member.token.nil? && member.token.token_exp.to_i <= Time.now.to_i
      member.token.update(access_token: auth.credentials.token, token_exp: auth.credentials.expires_at)
    elsif member.token.nil?
      member.create_token(access_token: auth.credentials.token, token_exp: auth.credentials.expires_at)
    end

    email_domain = member.email.split('@').last
    if email_domain == 'tamu.edu'
      # Allow login if the email domain is tamu.edu
      if member.present?
---
INSERT INTO "members" ("email", "full_name", "uid", "avatar_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "members".* FROM "members" WHERE "members"."email" = $1 LIMIT $2  [["email", "abhidev979@tamu.edu"], ["LIMIT", 1]]