app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "date", "description", "location", "rsvp_link", "feedback_link", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "name" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["name", "test event asdf"], ["updated_at", "2024-09-18 03:17:07.795559"], ["id", 1]]

  def delete
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def rsvp_form
    require 'google/apis/forms_v1'

    @event = Event.find(params[:id])

    rsvp_form_id = Event.find(params[:id]).rsvp_link

    # Check that there is an rsvp form to show
    if defined?(rsvp_form_id) && !rsvp_form_id.blank?
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "events".* FROM "events"

  def create_form
    require 'google/apis/forms_v1'
    require 'google/apis/drive_v3'

    @event = Event.find(params[:id])

    rsvp_form_id = Event.find(params[:id]).rsvp_link

    # Create a form if no form exists already. Else, re-render current page
    if !defined?(rsvp_form_id) || rsvp_form_id.blank?
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]



      # Check that event entity is updated successfully
      if @event.update(rsvp_link: @new_form.form_id)
---
UPDATE "events" SET "rsvp_link" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["rsvp_link", "1AKAyxyk5qcfMANGC-51zLnArc2WhomeSY-vL5ToRP24"], ["updated_at", "2024-09-23 13:39:00.385538"], ["id", 3]]

  def delete_form
    require 'google/apis/drive_v3'

    @event = Event.find(params[:id])

    rsvp_form_id = Event.find(params[:id]).rsvp_link

    # Delete a form if a form exists already. Else, re-render current page
    if defined?(rsvp_form_id) && !rsvp_form_id.blank?
      drive = Google::Apis::DriveV3::DriveService.new

      drive_scopes = ['https://www.googleapis.com/auth/drive.file']
      drive.authorization = Google::Auth.get_application_default(drive_scopes)

      drive.delete_file(rsvp_form_id)

      # Check that event entity is updated successfully
      if @event.update(rsvp_link: '')
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "events" SET "rsvp_link" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["rsvp_link", ""], ["updated_at", "2024-09-23 14:52:15.561944"], ["id", 4]]