app/controllers/events_controller.rb

UPDATE "events" SET "rsvp_link" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["rsvp_link", ""], ["updated_at", "2024-09-23 13:50:40.988530"], ["id", 3]]
---
        drive.update_file(@new_form.form_id, {name: "RSVP Form For " + @event.name})

        # Check that event entity is updated successfully
        if @event.update(rsvp_id: @new_form.form_id, rsvp_link: @new_form.responder_uri)

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def destroy_rsvp_form
    require 'google/apis/drive_v3'

    @event = Event.find(params[:id])