app/models/member.rb

INSERT INTO "members" ("email", "full_name", "uid", "avatar_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "members".* FROM "members" WHERE "members"."email" = $1 LIMIT $2  [["email", "abhidev979@tamu.edu"], ["LIMIT", 1]]
---
  def self.from_google(email:, full_name:, uid:, avatar_url:, google_token:, token_exp_date:)
    create_with(uid: uid, full_name: full_name, avatar_url: avatar_url, google_token: google_token, token_exp_date: token_exp_date).find_or_create_by!(email: email)